Nat-thapas/STM32-ILI9341/Src/ili9341.c
    // VCM CONTROL
    ILI9341_WriteCommand(ili9341, 0xC5);
    {
        uint8_t data[] = {0x3E, 0x28};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // VCM CONTROL 2
    ILI9341_WriteCommand(ili9341, 0xC7);
    {
        uint8_t data[] = {0x86};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // MEMORY ACCESS CONTROL
    ILI9341_WriteCommand(ili9341, 0x36);
    {
        uint8_t data[] = {0x48};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // PIXEL FORMAT
    ILI9341_WriteCommand(ili9341, 0x3A);
    {
        uint8_t data[] = {0x55};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // FRAME RATIO CONTROL, STANDARD RGB COLOR
    ILI9341_WriteCommand(ili9341, 0xB1);
    {
        uint8_t data[] = {0x00, 0x18};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // DISPLAY FUNCTION CONTROL
    ILI9341_WriteCommand(ili9341, 0xB6);
    {
        uint8_t data[] = {0x08, 0x82, 0x27};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // 3GAMMA FUNCTION DISABLE
    ILI9341_WriteCommand(ili9341, 0xF2);
    {
        uint8_t data[] = {0x00};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // GAMMA CURVE SELECTED
    ILI9341_WriteCommand(ili9341, 0x26);
    {
        uint8_t data[] = {0x01};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // POSITIVE GAMMA CORRECTION
    ILI9341_WriteCommand(ili9341, 0xE0);
    {
        uint8_t data[] = {0x0F, 0x31, 0x2B, 0x0C, 0x0E, 0x08, 0x4E, 0xF1, 0x37, 0x07, 0x10, 0x03, 0x0E, 0x09, 0x00};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // NEGATIVE GAMMA CORRECTION
    ILI9341_WriteCommand(ili9341, 0xE1);
    {
        uint8_t data[] = {0x00, 0x0E, 0x14, 0x03, 0x11, 0x07, 0x31, 0xC1, 0x48, 0x08, 0x0F, 0x0C, 0x31, 0x36, 0x0F};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    // EXIT SLEEP
    ILI9341_WriteCommand(ili9341, 0x11);
    HAL_Delay(120);

    // TURN ON DISPLAY
    ILI9341_WriteCommand(ili9341, 0x29);

    // MADCTL
    ILI9341_WriteCommand(ili9341, 0x36);
    switch (ili9341->rotation) {
        case ILI9341_ROTATION_VERTICAL_1: {
            uint8_t rotation = ILI9341_MADCTL_MX | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_HORIZONTAL_1: {
            uint8_t rotation = ILI9341_MADCTL_MX | ILI9341_MADCTL_MY | ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_HORIZONTAL_2: {
            uint8_t rotation = ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_VERTICAL_2: {
            uint8_t rotation = ILI9341_MADCTL_MY | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }

        default:
            break;
    }

    ILI9341_Deselect(ili9341);

    return ili9341_instance;
}

void ILI9341_SetOrientation(ILI9341_HandleTypeDef* ili9341, int_fast8_t rotation) {
    ILI9341_Select(ili9341);

    // MADCTL
    ILI9341_WriteCommand(ili9341, 0x36);
    switch (rotation) {
        case ILI9341_ROTATION_VERTICAL_1: {
            uint8_t rotation = ILI9341_MADCTL_MX | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_HORIZONTAL_1: {
            uint8_t rotation = ILI9341_MADCTL_MX | ILI9341_MADCTL_MY | ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_HORIZONTAL_2: {
            uint8_t rotation = ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }
        case ILI9341_ROTATION_VERTICAL_2: {
            uint8_t rotation = ILI9341_MADCTL_MY | ILI9341_MADCTL_BGR;
            uint8_t data[] = {rotation};
            ILI9341_WriteData(ili9341, data, sizeof(data));
            break;
        }

        default:
            break;
    }

    if ((ili9341->rotation == ILI9341_ROTATION_HORIZONTAL_1 || ili9341->rotation == ILI9341_ROTATION_HORIZONTAL_2) &&
        (rotation == ILI9341_ROTATION_VERTICAL_1 || rotation == ILI9341_ROTATION_VERTICAL_2)) {
        int_fast16_t temp = ili9341->width;
        ili9341->width = ili9341->height;
        ili9341->height = temp;
    } else if ((ili9341->rotation == ILI9341_ROTATION_VERTICAL_1 || ili9341->rotation == ILI9341_ROTATION_VERTICAL_2) &&
               (rotation == ILI9341_ROTATION_HORIZONTAL_1 || rotation == ILI9341_ROTATION_HORIZONTAL_2)) {
        int_fast16_t temp = ili9341->width;
        ili9341->width = ili9341->height;
        ili9341->height = temp;
    }

    ili9341->rotation = rotation;

    ILI9341_Deselect(ili9341);
}

void ILI9341_SetBrightness(ILI9341_HandleTypeDef* ili9341, uint_fast8_t brightness) {
    ILI9341_Select(ili9341);

    ILI9341_WriteCommand(ili9341, 0x51);
    {
        uint8_t data[] = {brightness & 0xFF};
        ILI9341_WriteData(ili9341, data, sizeof(data));
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Draw a pixel at specified coordinates without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the pixel
 * @param y Y coordinate of the pixel
 * @param color 16-bit pixel color in RGB565 format
 */
static void ILI9341_DrawPixelFast(ILI9341_HandleTypeDef* ili9341, int_fast16_t x, int_fast16_t y, uint16_t color) {
    if (x < 0 || y < 0 || x >= ili9341->width || y >= ili9341->height) return;

    ILI9341_SetAddressWindow(ili9341, x, y, x + 1, y + 1);
    uint8_t data[] = {color >> 8, color & 0xFF};
    ILI9341_WriteData(ili9341, data, sizeof(data));
}

void ILI9341_DrawPixel(ILI9341_HandleTypeDef* ili9341, int_fast16_t x, int_fast16_t y, uint16_t color) {
    ILI9341_Select(ili9341);
    ILI9341_DrawPixelFast(ili9341, x, y, color);
    ILI9341_Deselect(ili9341);
}

/**
 * @brief Fill a rectangle without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the top-left corner of the rectangle
 * @param y Y coordinate of the top-left corner of the rectangle
 * @param w Width of the rectangle in pixels, can be negative
 * @param h Height of the rectangle in pixels, can be negative
 * @param color 16-bit fill color in RGB565 format
 */
static void ILI9341_FillRectangleFast(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    int_fast16_t w,
    int_fast16_t h,
    uint16_t color
) {
    if (w < 0) {
        w = -w;
        x -= w - 1;
    }

    if (h < 0) {
        h = -h;
        y -= h - 1;
    }

