Nat-thapas/STM32-ILI9341/Src/ili9341.c
    if (x >= ili9341->width || y >= ili9341->height || w == 0 || h == 0) return;

    if (x < 0) {
        w += x;
        x = 0;
        if (w <= 0) return;
    }

    if (y < 0) {
        h += y;
        y = 0;
        if (h <= 0) return;
    }

    if ((x + w - 1) >= ili9341->width) w = ili9341->width - x;
    if ((y + h - 1) >= ili9341->height) h = ili9341->height - y;

    uint8_t buffer[ILI9341_FILL_RECT_BUFFER_SIZE * 2];
    size_t totalSize = w * h;
    size_t chunkSize = totalSize > ILI9341_FILL_RECT_BUFFER_SIZE ? ILI9341_FILL_RECT_BUFFER_SIZE : totalSize;

    color = (color >> 8) | (color << 8);
    for (size_t i = 0; i < chunkSize; i++) { *(uint16_t*)&buffer[i * 2] = color; }

    ILI9341_SetAddressWindow(ili9341, x, y, x + w - 1, y + h - 1);

    while (totalSize > 0) {
        ILI9341_WriteData(ili9341, buffer, chunkSize * 2);
        totalSize -= chunkSize;
        chunkSize = (totalSize > ILI9341_FILL_RECT_BUFFER_SIZE) ? ILI9341_FILL_RECT_BUFFER_SIZE : totalSize;
    }
}

void ILI9341_FillRectangle(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    int_fast16_t w,
    int_fast16_t h,
    uint16_t color
) {
    ILI9341_Select(ili9341);
    ILI9341_FillRectangleFast(ili9341, x, y, w, h, color);
    ILI9341_Deselect(ili9341);
}

void ILI9341_FillScreen(ILI9341_HandleTypeDef* ili9341, uint16_t color) {
    ILI9341_Select(ili9341);
    ILI9341_FillRectangleFast(ili9341, 0, 0, ili9341->width, ili9341->height, color);
    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a character at specified coordinates without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the top-left of the character
 * @param y Y coordinate of the top-left of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param bgColor 16-bit background color in RGB565 format
 */
static void ILI9341_WriteChar(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    char ch,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor
) {
    int_fast16_t endX = x + font.width - 1;
    int_fast16_t endY = y + font.height - 1;

    if (endX < 0 || endY < 0 || x >= ili9341->width || y >= ili9341->height) return;

    int_fast16_t clipStartX = x < 0 ? -x : 0;
    int_fast16_t clipStartY = y < 0 ? -y : 0;
    int_fast16_t clipEndX = endX >= ili9341->width ? ili9341->width - x - 1 : font.width - 1;
    int_fast16_t clipEndY = endY >= ili9341->height ? ili9341->height - y - 1 : font.height - 1;

    if (ch < 32 || ch > 126) ch = 32;

    color = (color >> 8) | (color << 8);
    bgColor = (bgColor >> 8) | (bgColor << 8);

    uint16_t buffer[ILI9341_WRITE_CHAR_BUFFER_SIZE];
    size_t bufferIndex = 0;

    int_fast16_t index = (ch - 32) * font.intsPerGlyph;
    uint32_t mask = 0x80000000;

    ILI9341_SetAddressWindow(ili9341, x + clipStartX, y + clipStartY, x + clipEndX, y + clipEndY);

    for (int_fast16_t row = 0; row < font.height; row++) {
        for (int_fast16_t col = 0; col < font.width; col++) {
            if (row >= clipStartY && row <= clipEndY && col >= clipStartX && col <= clipEndX) {
                if (font.data[index] & mask) {
                    buffer[bufferIndex++] = color;
                } else {
                    buffer[bufferIndex++] = bgColor;
                }

                if (bufferIndex >= ILI9341_WRITE_CHAR_BUFFER_SIZE) {
                    ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
                    bufferIndex = 0;
                }
            }

            mask >>= 1;
            if (mask == 0) {
                index++;
                mask = 0x80000000;
            }
        }
    }

    if (bufferIndex > 0) ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
}

void ILI9341_WriteString(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    const char* str,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor,
    int_fast16_t tracking
) {
    if (y >= ili9341->height) return;

    ILI9341_Select(ili9341);

    while (*str && x < ili9341->width) {
        ILI9341_WriteChar(ili9341, x, y, *str, font, color, bgColor);
        x += font.width + tracking;
        str++;
    }

    ILI9341_Deselect(ili9341);
}

/**
 * @brief Write a scaled character at specified coordinates without selecting/deselecting the display
 * @param ili9341 Pointer to ILI9341 handle structure
 * @param x X coordinate of the top-left of the character
 * @param y Y coordinate of the top-left of the character
 * @param ch ASCII character to write
 * @param font Font definition to use for rendering the character
 * @param color 16-bit character color in RGB565 format
 * @param bgColor 16-bit background color in RGB565 format
 * @param scale Scaling factor (integer) to enlarge the character
 */
static void ILI9341_WriteCharScaled(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    char ch,
    ILI9341_FontDef font,
    uint16_t color,
    uint16_t bgColor,
    int_fast16_t scale
) {
    int_fast16_t endX = x + font.width * scale - 1;
    int_fast16_t endY = y + font.height * scale - 1;

    if (endX < 0 || endY < 0 || x >= ili9341->width || y >= ili9341->height) return;

    int_fast16_t clipStartX = x < 0 ? -x : 0;
    int_fast16_t clipStartY = y < 0 ? -y : 0;
    int_fast16_t clipEndX = endX >= ili9341->width ? ili9341->width - x - 1 : font.width * scale - 1;
    int_fast16_t clipEndY = endY >= ili9341->height ? ili9341->height - y - 1 : font.height * scale - 1;

    if (ch < 32 || ch > 126) ch = 32;

    color = (color >> 8) | (color << 8);
    bgColor = (bgColor >> 8) | (bgColor << 8);

    uint16_t buffer[ILI9341_WRITE_CHAR_BUFFER_SIZE];
    size_t bufferIndex = 0;

    int_fast32_t bitIndex = (ch - 32) * font.intsPerGlyph * 32;

    ILI9341_SetAddressWindow(ili9341, x + clipStartX, y + clipStartY, x + clipEndX, y + clipEndY);

    for (int_fast16_t row = 0; row < font.height; row++) {
        for (int_fast16_t vScale = 0; vScale < scale; vScale++) {
            int_fast16_t pixelRow = row * scale + vScale;
            for (int_fast16_t col = 0; col < font.width; col++) {
                uint32_t mask = 0x80000000 >> (bitIndex % 32);
                int_fast16_t index = bitIndex / 32;
                for (int_fast16_t hScale = 0; hScale < scale; hScale++) {
                    int_fast16_t pixelCol = col * scale + hScale;
                    if (pixelRow >= clipStartY && pixelRow <= clipEndY && pixelCol >= clipStartX &&
                        pixelCol <= clipEndX) {
                        if (font.data[index] & mask) {
                            buffer[bufferIndex++] = color;
                        } else {
                            buffer[bufferIndex++] = bgColor;
                        }

                        if (bufferIndex >= ILI9341_WRITE_CHAR_BUFFER_SIZE) {
                            ILI9341_WriteData(ili9341, (uint8_t*)buffer, bufferIndex * 2);
                            bufferIndex = 0;
                        }
                    }
                }
                bitIndex++;
            }
            bitIndex -= font.width;
        }
        bitIndex += font.width;
    }

