Nat-thapas/STM32-ILI9341/Src/ili9341.c
void ILI9341_DrawLineThick(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x1,
    int_fast16_t y1,
    int_fast16_t x2,
    int_fast16_t y2,
    uint16_t color,
    int_fast16_t thickness,
    bool cap
) {
    if (thickness <= 0) return;

    // calculate line vector
    int_fast16_t dx = x2 - x1;
    int_fast16_t dy = y2 - y1;
    float length = sqrtf(dx * dx + dy * dy);
    if (length == 0) return;  // zero-length line

    // unit vector
    float ux = dx / length;
    float uy = dy / length;

    // perpendicular vector
    float px = -uy;
    float py = ux;

    // half thickness
    float halfThickness = thickness / 2.0f;

    // calculate corner points
    int16_t xCorners[4] = {
        (int16_t)(x1 + px * halfThickness),
        (int16_t)(x1 - px * halfThickness),
        (int16_t)(x2 - px * halfThickness),
        (int16_t)(x2 + px * halfThickness)
    };
    int16_t yCorners[4] = {
        (int16_t)(y1 + py * halfThickness),
        (int16_t)(y1 - py * halfThickness),
        (int16_t)(y2 - py * halfThickness),
        (int16_t)(y2 + py * halfThickness)
    };

    ILI9341_FillPolygon(ili9341, xCorners, yCorners, 4, color);

    if (cap) {
        ILI9341_FillCircle(ili9341, x1, y1, halfThickness, color);
        ILI9341_FillCircle(ili9341, x2, y2, halfThickness, color);
    }
}

void ILI9341_DrawRectangle(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    int_fast16_t w,
    int_fast16_t h,
    uint16_t color
) {
    ILI9341_DrawRectangleThick(ili9341, x, y, w, h, color, 1);
}

void ILI9341_DrawRectangleThick(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t x,
    int_fast16_t y,
    int_fast16_t w,
    int_fast16_t h,
    uint16_t color,
    int_fast16_t thickness
) {
    if (thickness <= 0) return;

    ILI9341_Select(ili9341);

    ILI9341_FillRectangleFast(ili9341, x, y, w, thickness, color);                              // top
    ILI9341_FillRectangleFast(ili9341, x, y + h - thickness, w, thickness, color);              // bottom
    ILI9341_FillRectangleFast(ili9341, x, y + thickness, thickness, h - 2 * thickness, color);  // left
    ILI9341_FillRectangleFast(ili9341, x + w - thickness, y + thickness, thickness, h - 2 * thickness, color);  // right

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawCircle(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t r,
    uint16_t color
) {
    r = abs(r);
    if (r == 0 || xc + r < 0 || xc - r >= ili9341->width || yc + r < 0 || yc - r >= ili9341->height) return;

    int_fast16_t f = 1 - r;
    int_fast16_t dfx = -2 * r;
    int_fast16_t dfy = 1;
    int_fast16_t x = r;
    int_fast16_t y = 0;

    ILI9341_Select(ili9341);

    ILI9341_DrawPixelFast(ili9341, xc, yc + r, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc - r, color);
    ILI9341_DrawPixelFast(ili9341, xc + r, yc, color);
    ILI9341_DrawPixelFast(ili9341, xc - r, yc, color);

    while (x >= y) {
        if (f >= 0) {
            x--;
            dfx += 2;
            f += dfx;
        }
        y++;
        dfy += 2;
        f += dfy;

        ILI9341_DrawPixelFast(ili9341, xc + x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc + x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc + y, yc + x, color);
        ILI9341_DrawPixelFast(ili9341, xc - y, yc + x, color);
        ILI9341_DrawPixelFast(ili9341, xc + y, yc - x, color);
        ILI9341_DrawPixelFast(ili9341, xc - y, yc - x, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawCircleThick(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t r,
    uint16_t color,
    int_fast16_t thickness
) {
    r = abs(r);
    if (r == 0 || thickness <= 0 || xc + r < 0 || xc - r >= ili9341->width || yc + r < 0 || yc - r >= ili9341->height)
        return;
    if (thickness > r) thickness = r;

    int_fast16_t ri = r - thickness;
    int_fast16_t xo = r;
    int_fast16_t xi = ri;

    ILI9341_Select(ili9341);

    for (int_fast16_t y = 0; y <= r; y++) {
        while (xo * xo + y * y > r * r) { xo--; }
        while (xi * xi + y * y > ri * ri && xi > 0) { xi--; }

        ILI9341_DrawLineFast(ili9341, xc - xo, yc + y, xc - xi, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc + y, xc + xo, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - xo, yc - y, xc - xi, yc - y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc - y, xc + xo, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_FillCircle(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t r,
    uint16_t color
) {
    r = abs(r);
    if (r == 0 || xc + r < 0 || xc - r >= ili9341->width || yc + r < 0 || yc - r >= ili9341->height) return;

    int_fast16_t f = 1 - r;
    int_fast16_t dfx = -2 * r;
    int_fast16_t dfy = 1;
    int_fast16_t x = r;
    int_fast16_t y = 0;

    ILI9341_Select(ili9341);

    ILI9341_DrawLineFast(ili9341, xc - r, yc, xc + r, yc, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc + r, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc - r, color);

    while (x >= y) {
        if (f >= 0) {
            x--;
            dfx += 2;
            f += dfx;
        }
        y++;
        dfy += 2;
        f += dfy;

        ILI9341_DrawLineFast(ili9341, xc - x, yc + y, xc + x, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - x, yc - y, xc + x, yc - y, color);
        ILI9341_DrawLineFast(ili9341, xc - y, yc + x, xc + y, yc + x, color);
        ILI9341_DrawLineFast(ili9341, xc - y, yc - x, xc + y, yc - x, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawEllipse(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t rx,
    int_fast16_t ry,
    uint16_t color
) {
    rx = abs(rx);
    ry = abs(ry);
    if (rx == 0 || ry == 0 || xc + rx < 0 || xc - rx >= ili9341->width || yc + ry < 0 || yc - ry >= ili9341->height)
        return;

    int_fast32_t rx2 = rx * rx;
    int_fast32_t ry2 = ry * ry;
    int_fast32_t twoRx2 = 2 * rx2;
    int_fast32_t twoRy2 = 2 * ry2;
    int_fast32_t p;
    int_fast32_t x = 0;
    int_fast32_t y = ry;
    int_fast32_t px = 0;
    int_fast32_t py = twoRx2 * y;

    ILI9341_Select(ili9341);

    ILI9341_DrawPixelFast(ili9341, xc, yc + ry, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc - ry, color);

    p = ry2 - (rx2 * ry) + (rx2 / 4);
    while (px < py) {
        x++;
        px += twoRy2;
        if (p < 0) {
            p += ry2 + px;
        } else {
            y--;
            py -= twoRx2;
            p += ry2 + px - py;
        }

