Nat-thapas/STM32-ILI9341/Src/ili9341.c
        ILI9341_DrawPixelFast(ili9341, xc + x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc + x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc - y, color);
    }

    p = ry2 * (x + 1) * (x + 1) + rx2 * (y - 1) * (y - 1) - rx2 * ry2;
    while (y > 0) {
        y--;
        py -= twoRx2;
        if (p > 0) {
            p += rx2 - py;
        } else {
            x++;
            px += twoRy2;
            p += rx2 - py + px;
        }

        ILI9341_DrawPixelFast(ili9341, xc + x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc + y, color);
        ILI9341_DrawPixelFast(ili9341, xc + x, yc - y, color);
        ILI9341_DrawPixelFast(ili9341, xc - x, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawEllipseThick(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t rx,
    int_fast16_t ry,
    uint16_t color,
    int_fast16_t thickness
) {
    rx = abs(rx);
    ry = abs(ry);
    if (rx == 0 || ry == 0 || thickness <= 0 || xc + rx < 0 || xc - rx >= ili9341->width || yc + ry < 0 ||
        yc - ry >= ili9341->height)
        return;
    if (thickness > rx || thickness > ry) {
        ILI9341_FillEllipse(ili9341, xc, yc, rx, ry, color);
        return;
    }

    int_fast16_t x = rx;
    int_fast16_t y = 0;
    int_fast16_t rxi = rx - thickness;
    int_fast16_t ryi = ry - thickness;
    int_fast16_t xi = rxi;

    ILI9341_Select(ili9341);

    for (int_fast16_t y = 0; y <= ry; y++) {
        while (x * x * ry * ry + y * y * rx * rx > rx * rx * ry * ry) { x--; }
        while (xi * xi * ryi * ryi + y * y * rxi * rxi > rxi * rxi * ryi * ryi && xi > 0) { xi--; }
        ILI9341_DrawLineFast(ili9341, xc - x, yc + y, xc - xi, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc + y, xc + x, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - x, yc - y, xc - xi, yc - y, color);
        ILI9341_DrawLineFast(ili9341, xc + xi, yc - y, xc + x, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_FillEllipse(
    ILI9341_HandleTypeDef* ili9341,
    int_fast16_t xc,
    int_fast16_t yc,
    int_fast16_t rx,
    int_fast16_t ry,
    uint16_t color
) {
    rx = abs(rx);
    ry = abs(ry);
    if (rx == 0 || ry == 0 || xc + rx < 0 || xc - rx >= ili9341->width || yc + ry < 0 || yc - ry >= ili9341->height)
        return;

    int_fast32_t rx2 = rx * rx;
    int_fast32_t ry2 = ry * ry;
    int_fast32_t twoRx2 = 2 * rx2;
    int_fast32_t twoRy2 = 2 * ry2;
    int_fast32_t p;
    int_fast32_t x = 0;
    int_fast32_t y = ry;
    int_fast32_t px = 0;
    int_fast32_t py = twoRx2 * y;

    ILI9341_Select(ili9341);

    ILI9341_DrawLineFast(ili9341, xc - rx, yc, xc + rx, yc, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc + ry, color);
    ILI9341_DrawPixelFast(ili9341, xc, yc - ry, color);

    p = ry2 - (rx2 * ry) + (rx2 / 4);
    while (px < py) {
        x++;
        px += twoRy2;
        if (p < 0) {
            p += ry2 + px;
        } else {
            y--;
            py -= twoRx2;
            p += ry2 + px - py;
        }

        ILI9341_DrawLineFast(ili9341, xc - x, yc + y, xc + x, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - x, yc - y, xc + x, yc - y, color);
    }

    p = ry2 * (x + 1) * (x + 1) + ry2 / 4 + rx2 * (y - 1) * (y - 1) - rx2 * ry2;
    while (y > 0) {
        y--;
        py -= twoRx2;
        if (p > 0) {
            p += rx2 - py;
        } else {
            x++;
            px += twoRy2;
            p += rx2 - py + px;
        }

        ILI9341_DrawLineFast(ili9341, xc - x, yc + y, xc + x, yc + y, color);
        ILI9341_DrawLineFast(ili9341, xc - x, yc - y, xc + x, yc - y, color);
    }

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawPolygon(ILI9341_HandleTypeDef* ili9341, int16_t* x, int16_t* y, size_t n, uint16_t color) {
    if (n < 2) return;

    ILI9341_Select(ili9341);

    for (size_t i = 0; i < n - 1; i++) { ILI9341_DrawLineFast(ili9341, x[i], y[i], x[i + 1], y[i + 1], color); }
    ILI9341_DrawLineFast(ili9341, x[n - 1], y[n - 1], x[0], y[0], color);

    ILI9341_Deselect(ili9341);
}

void ILI9341_DrawPolygonThick(
    ILI9341_HandleTypeDef* ili9341,
    int16_t* x,
    int16_t* y,
    size_t n,
    uint16_t color,
    int_fast16_t thickness,
    bool cap
) {
    if (n < 2 || thickness <= 0) return;

    for (size_t i = 0; i < n - 1; i++) {
        ILI9341_DrawLineThick(ili9341, x[i], y[i], x[i + 1], y[i + 1], color, thickness, cap);
    }
    ILI9341_DrawLineThick(ili9341, x[n - 1], y[n - 1], x[0], y[0], color, thickness, cap);
}

void ILI9341_FillPolygon(ILI9341_HandleTypeDef* ili9341, int16_t* x, int16_t* y, size_t n, uint16_t color) {
    if (n < 3) return;

    // find max and min Y
    int_fast16_t minY = y[0], maxY = y[0];
    for (size_t i = 1; i < n; i++) {
        if (y[i] < minY) minY = y[i];
        if (y[i] > maxY) maxY = y[i];
    }

    if (minY >= ili9341->height) return;
    if (maxY < 0) return;
    if (minY < 0) minY = 0;
    if (maxY >= ili9341->height) maxY = ili9341->height - 1;

    int_fast16_t nodeX[32];  // max 32 intersections

    ILI9341_Select(ili9341);

    // scanline algorithm
    for (int_fast16_t j = minY; j <= maxY; j++) {
        int_fast16_t nodes = 0;
        int_fast16_t k = n - 1;

        // find intersections
        for (int_fast16_t i = 0; i < n; i++) {
            if ((y[i] < j && y[k] >= j) || (y[k] < j && y[i] >= j)) {
                int_fast16_t dy = y[k] - y[i];
                if (dy != 0 && nodes < 32) {
                    nodeX[nodes++] = x[i] + ((int_fast32_t)(j - y[i]) * (int_fast32_t)(x[k] - x[i])) / dy;
                }
            }
            k = i;
        }

        // insertion sort nodeX array
        for (int_fast16_t i = 1; i < nodes; i++) {
            int_fast16_t key = nodeX[i];
            int_fast16_t jSort = i - 1;
            while (jSort >= 0 && nodeX[jSort] > key) {
                nodeX[jSort + 1] = nodeX[jSort];
                jSort--;
            }
            nodeX[jSort + 1] = key;
        }

        // fill the pixels between node pairs
        for (int_fast16_t i = 0; i < nodes - 1; i += 2) {
            int_fast16_t x1 = nodeX[i];
            int_fast16_t x2 = nodeX[i + 1];

            if (x1 >= ili9341->width) break;
            if (x2 >= ili9341->width) x2 = ili9341->width - 1;
            if (x1 < ili9341->width && x2 > 0 && x2 >= x1) {
                ILI9341_FillRectangleFast(ili9341, x1, j, x2 - x1 + 1, 1, color);
            }
        }
    }

    ILI9341_Deselect(ili9341);
}
